paulbartell/renesas-demo/target/rx65n/ota_pal_rx65n.c
static uint8_t * otaPal_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    uint8_t * pucCertData;
    uint32_t ulCertSize;
    uint8_t * pucSignerCert = NULL;
    CK_RV xResult;

    xResult = prvGetCertificate( ( const char * ) pucCertName, &pucSignerCert, ulSignerCertSize );

    if( ( xResult == CKR_OK ) && ( pucSignerCert != NULL ) )
    {
        LogInfo( ( "otaPal_ReadAndAssumeCertificate using cert with label: %s", ( const char * ) pucCertName ) );
    }
    else
    {
        LogWarn( ( "No such certificate file: %s. Using certificate defined by the otapalconfigCODE_SIGNING_CERTIFICATE macro instead",
                   ( const char * ) pucCertName ) );

        /* Allocate memory for the signer certificate plus a terminating zero so we can copy it and return to the caller. */
        ulCertSize = sizeof( otapalconfigCODE_SIGNING_CERTIFICATE );
        pucSignerCert = pvPortMalloc( ulCertSize + 1 );                   /*lint !e9029 !e9079 !e838 malloc proto requires void*. */
        pucCertData = ( uint8_t * ) otapalconfigCODE_SIGNING_CERTIFICATE; /*lint !e9005 we don't modify the cert but it could be set by PKCS11 so it's not const. */

        if( pucSignerCert != NULL )
        {
            memcpy( pucSignerCert, pucCertData, ulCertSize );
            /* The crypto code requires the terminating zero to be part of the length so add 1 to the size. */
            pucSignerCert[ ulCertSize ] = 0U;
            *ulSignerCertSize = ulCertSize + 1U;
        }
        else
        {
            LogError( ( "Failed to store the certificate in dynamic memory: pvPortMalloc failed to allocate a buffer of size %d", ulCertSize ) );
        }
    }

    return pucSignerCert;
}
/*-----------------------------------------------------------*/

OtaPalStatus_t otaPal_ResetDevice( OtaFileContext_t * const pFileContext )
{
    ( void ) pFileContext;

    LogInfo( ( "Resetting the device." ) );

    if( ( OtaImageStateAccepted == load_firmware_control_block.eSavedAgentState ) ||
        ( OtaImageStateTesting == load_firmware_control_block.eSavedAgentState ) )
    {
        /* Software reset issued (Not swap bank) */
        set_psw( 0 );
        R_BSP_InterruptsDisable();
        R_BSP_RegisterProtectDisable( BSP_REG_PROTECT_LPC_CGC_SWR );
        SYSTEM.SWRR = 0xa501;

        while( 1 ) /* software reset */
        {
        }
    }
    else
    {
        /* If the status is rejected, aborted, or error, swap bank and return to the previous image.
         * Then the boot loader will start and erase the image that failed to update. */
        set_psw( 0 );
        R_BSP_InterruptsDisable();

        /* For test code: If you want to run OTA without boot_loader, please remove the following comment out. */
        // R_FLASH_Control( FLASH_CMD_BANK_TOGGLE, NULL );

        R_BSP_RegisterProtectDisable( BSP_REG_PROTECT_LPC_CGC_SWR );
        SYSTEM.SWRR = 0xa501;

        while( 1 ) /* software reset */
        {
        }
    }

    /* We shouldn't actually get here if the board supports the auto reset.
     * But, it doesn't hurt anything if we do although someone will need to
     * reset the device for the new image to boot. */
    return OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
}
/*-----------------------------------------------------------*/

OtaPalStatus_t otaPal_ActivateNewImage( OtaFileContext_t * const pFileContext )
{
    LogInfo( ( "Changing the Startup Bank" ) );

    /* reset for self testing */
    vTaskDelay( 5000 );
    otaPal_ResetDevice( pFileContext ); /* no return from this function */

    return OTA_PAL_COMBINE_ERR( OtaPalSuccess, 0 );
}
/*-----------------------------------------------------------*/

OtaPalStatus_t otaPal_SetPlatformImageState( OtaFileContext_t * const pFileContext,
                                             OtaImageState_t eState )
{
    flash_interrupt_config_t cb_func_info;

    LogDebug( ( "otaPal_SetPlatformImageState is called." ) );

    OtaPalMainStatus_t eResult = OtaPalUninitialized;

    /* Save the image state to eSavedAgentState. */
    if( OtaImageStateTesting == load_firmware_control_block.eSavedAgentState )
    {
        switch( eState )
        {
            case OtaImageStateAccepted:
                R_FLASH_Close();
                R_FLASH_Open();
                cb_func_info.pcallback = ota_header_flashing_callback;
                cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
                R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
                gs_header_flashing_task = OTA_FLASHING_IN_PROGRESS;

                if( R_FLASH_Erase( ( flash_block_address_t ) BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER ) == FLASH_SUCCESS )
                {
                    while( OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task )
                    {
                    }

                    LogInfo( ( "Erase install area (code flash):OK" ) );
                    LogInfo( ( "Accepted and committed final image." ) );
                    eResult = OtaPalSuccess;
                }
                else
                {
                    LogError( ( "Erase install area (code flash):NG" ) );
                    LogError( ( "Accepted final image but commit failed." ) );
                    eResult = OtaPalCommitFailed;
                }

                break;

            case OtaImageStateRejected:
                LogInfo( ( "Rejected image." ) );
                eResult = OtaPalSuccess;
                break;

            case OtaImageStateAborted:
                LogInfo( ( "Aborted image." ) );
                eResult = OtaPalSuccess;
                break;

            case OtaImageStateTesting:
                LogInfo( ( "Testing." ) );
                eResult = OtaPalSuccess;
                break;

            default:
                LogError( ( "Unknown state received %d.", ( int32_t ) eState ) );
                eResult = OtaPalBadImageState;
                break;
        }
    }
    else
    {
        switch( eState )
        {
            case OtaImageStateAccepted:
                LogError( ( "Not in commit pending so can not mark image valid (%d)." ) );
                eResult = OtaPalCommitFailed;
                break;

            case OtaImageStateRejected:
                LogInfo( ( "Rejected image." ) );
                eResult = OtaPalSuccess;
                break;

            case OtaImageStateAborted:
                LogInfo( ( "Aborted image." ) );
                eResult = OtaPalSuccess;
                break;

            case OtaImageStateTesting:
                LogInfo( ( "Testing." ) );
                eResult = OtaPalSuccess;
                break;

            default:
                LogError( ( "Unknown state received %d.", ( int32_t ) eState ) );
                eResult = OtaPalBadImageState;
                break;
        }
    }

