paulbartell/renesas-demo/target/rx65n/ota_pal_rx65n.c
                memcpy( destination_pointer, source_pointer, OTA_SIGUNATURE_DATA_HALF_LENGTH );
                source_pointer += OTA_SIGUNATURE_DATA_HALF_LENGTH;
                destination_pointer += OTA_SIGUNATURE_DATA_HALF_LENGTH;

                if( ( source_pointer - pFileContext->pSignature->data ) == data_length )
                {
                    ret = R_OTA_ERR_NONE;
                    break;
                }
            }
            else
            {
                /* parsing error */
                break;
            }
        }
    }

    if( R_OTA_ERR_NONE == ret )
    {
        R_FLASH_Close();
        R_FLASH_Open();
        cb_func_info.pcallback = ota_header_flashing_callback;
        cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
        R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
        gs_header_flashing_task = OTA_FLASHING_IN_PROGRESS;
        length = BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH;
        flash_err = R_FLASH_Write( ( uint32_t ) block, ( uint32_t ) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, length );

        if( flash_err != FLASH_SUCCESS )
        {
            nop();
        }

        while( OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task )
        {
        }
    }

    return ret;
}

static void ota_context_close( OtaFileContext_t * pFileContext )
{
    if( NULL != pFileContext )
    {
        pFileContext->pFile = NULL;
    }
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_insert( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset,
                                                                         uint8_t * binary,
                                                                         uint32_t length )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp, * current, * previous, * new;

    new = pvPortMalloc( sizeof( FLASH_BLOCK ) );
    new->content.binary = pvPortMalloc( length );

    if( ( new != NULL ) && ( new->content.binary != NULL ) )
    {
        memcpy( new->content.binary, binary, length );
        new->content.offset = offset;
        new->content.length = length;
        new->next = NULL;

        /* new head would be returned when head would be specified as NULL. */
        if( head == NULL )
        {
            tmp = new;
        }
        else
        {
            /* search the list to insert new node */
            current = head;

            while( 1 )
            {
                if( ( new->content.offset < current->content.offset ) || ( current == NULL ) )
                {
                    break;
                }

                previous = current;
                current = current->next;
            }

            /* insert the searched node when current != head */
            if( current != head )
            {
                previous->next = new;
                new->next = current;
                tmp = head;
            }
            else
            {
                new->next = current;
                tmp = new;
            }
        }
    }
    else
    {
        tmp = NULL;
    }

    return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_delete( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                         uint32_t offset )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp = head, * previous = NULL;

    if( head != NULL )
    {
        while( 1 )
        {
            if( tmp->content.offset == offset )
            {
                break;
            }

            if( tmp->next == NULL )
            {
                tmp = NULL;
                break;
            }

            previous = tmp;
            tmp = tmp->next;
        }

        if( tmp != NULL )
        {
            /* delete target exists on not head, remove specified and return head in this case */
            if( previous != NULL )
            {
                previous->next = tmp->next;
                vPortFree( tmp->content.binary );
                vPortFree( tmp );
                tmp = head;
            }
            else
            {
                /* delete target exists on head with subsequent data, remove head and return specified (as new head) in this case */
                if( head->next != NULL )
                {
                    tmp = head->next;
                }
                /* delete target exists on head without subsequent data, remove head and return NULL in this case */
                else
                {
                    tmp = NULL;
                }

                vPortFree( head->content.binary );
                vPortFree( head );
            }
        }
    }

    return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_print( FRAGMENTED_FLASH_BLOCK_LIST * head )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp = head;
    uint32_t total_heap_length, total_list_count;

    total_heap_length = 0;
    total_list_count = 0;

    if( head != NULL )
    {
        while( 1 )
        {
            total_heap_length += sizeof( FRAGMENTED_FLASH_BLOCK_LIST );
            total_heap_length += tmp->content.length;
            total_list_count++;

            if( tmp->next == NULL )
            {
                break;
            }

            tmp = tmp->next;
        }
    }

    LogDebug( ( "FRAGMENTED_FLASH_BLOCK_LIST: total_heap_length = [%d], total_list_count = [%d].", total_heap_length, total_list_count ) );

    return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST * fragmented_flash_block_list_assemble( FRAGMENTED_FLASH_BLOCK_LIST * head,
                                                                           FLASH_BLOCK * flash_block )
{
    FRAGMENTED_FLASH_BLOCK_LIST * tmp = head;
    FRAGMENTED_FLASH_BLOCK_LIST * flash_block_candidate[ FLASH_CF_MIN_PGM_SIZE ];
    uint32_t assembled_length = 0;
    uint32_t fragmented_length = 0;
    uint32_t loop_counter = 0;
    uint32_t index = 0;

    /* search aligned FLASH_CF_MIN_PGM_SIZE top offset */
    while( 1 )
    {
        if( !( tmp->content.offset % FLASH_CF_MIN_PGM_SIZE ) )
        {
            /* extract continuous flash_block candidate */
            assembled_length = 0;
            loop_counter = 0;

            while( 1 )
            {
                if( ( tmp != NULL ) && ( assembled_length < FLASH_CF_MIN_PGM_SIZE ) )
                {
                    if( loop_counter < FLASH_CF_MIN_PGM_SIZE )
                    {
                        if( ( tmp->content.offset + tmp->content.length ) > ( ( tmp->content.offset & OTA_FLASH_MIN_PGM_SIZE_MASK ) + FLASH_CF_MIN_PGM_SIZE ) )
                        {
                            fragmented_length = ( FLASH_CF_MIN_PGM_SIZE - assembled_length );
                            assembled_length += fragmented_length;
                            flash_block_candidate[ loop_counter ] = tmp;
                            tmp->next = fragmented_flash_block_list_insert( tmp->next, tmp->content.offset + fragmented_length, &tmp->content.binary[ fragmented_length ], tmp->content.length - fragmented_length );
                            tmp->content.length = fragmented_length;
                        }
                        else
                        {
                            assembled_length += tmp->content.length;
                            flash_block_candidate[ loop_counter ] = tmp;
                        }
                    }
                    else
                    {
                        break;
                    }

                    tmp = tmp->next;
                    loop_counter++;
                }
                else
                {
                    break;
                }
            }
        }

