paulbartell/renesas-demo/target/rx65n/ota_pal_rx65n.c
        /* break if found completed flash_block_candidate or found end of list */
        if( ( assembled_length == FLASH_CF_MIN_PGM_SIZE ) || ( tmp == NULL ) )
        {
            break;
        }
        /* search next candidate */
        else
        {
            tmp = tmp->next;
        }
    }

    /* assemble flash_block */
    if( assembled_length == FLASH_CF_MIN_PGM_SIZE )
    {
        tmp = head;
        /* remove flash_block from list */
        flash_block->offset = flash_block_candidate[ 0 ]->content.offset;
        flash_block->length = assembled_length;

        for( uint32_t i = 0; i < loop_counter; i++ )
        {
            memcpy( &flash_block->binary[ index ], flash_block_candidate[ i ]->content.binary, flash_block_candidate[ i ]->content.length );
            index = flash_block_candidate[ i ]->content.length;
            tmp = fragmented_flash_block_list_delete( tmp, flash_block_candidate[ i ]->content.offset );
        }
    }
    else
    {
        tmp = head;
        flash_block->offset = NULL;
        flash_block->binary = NULL;
        flash_block->length = NULL;
    }

    return tmp;
}

static void ota_flashing_task( void * pvParameters )
{
    flash_err_t flash_err;
    static uint8_t block[ ( 1 << otaconfigLOG2_FILE_BLOCK_SIZE ) ];
    static uint32_t ulOffset;
    static uint32_t length;

    while( 1 )
    {
        xQueueReceive( xQueue, &packet_block_for_queue2, portMAX_DELAY );
        xSemaphoreTake( xSemaphoreFlashig, portMAX_DELAY );
        memcpy( block, packet_block_for_queue2.p_packet, packet_block_for_queue2.length );
        ulOffset = packet_block_for_queue2.ulOffset;
        length = packet_block_for_queue2.length;
        flash_err = R_FLASH_Write( ( uint32_t ) block, ulOffset + BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH, length );

        if( packet_block_for_queue2.length != 1024 )
        {
            nop();
        }

        if( flash_err != FLASH_SUCCESS )
        {
            nop();
        }

        load_firmware_control_block.total_image_length += length;
        vPortFree( packet_block_for_queue2.p_packet );
    }
}

static void ota_flashing_callback( void * event )
{
    uint32_t event_code;

    event_code = *( ( uint32_t * ) event );

    if( ( event_code != FLASH_INT_EVENT_WRITE_COMPLETE ) || ( event_code == FLASH_INT_EVENT_ERASE_COMPLETE ) )
    {
        nop(); /* trap */
    }

    static portBASE_TYPE xHigherPriorityTaskWoken;
    xSemaphoreGiveFromISR( xSemaphoreFlashig, &xHigherPriorityTaskWoken );
}

static void ota_header_flashing_callback( void * event )
{
    uint32_t event_code;

    event_code = *( ( uint32_t * ) event );

    gs_header_flashing_task = OTA_FLASHING_COMPLETE;

    if( ( event_code != FLASH_INT_EVENT_WRITE_COMPLETE ) || ( event_code == FLASH_INT_EVENT_ERASE_COMPLETE ) )
    {
        nop(); /* trap */
    }
}
